public class Bank {
 static int dolg = 7000;
    static void payment(int  a) {
        dolg -= a;
        if(dolg <= 0) {
            System.out.println("Ваш кредит погашен");
        }
        else {
            System.out.println("Кредит равен = " + dolg);
        }
    }
    public static void main(String[] args) {

        payment(700);
    }

}
   /* Використовуючи IntelliJ IDEA, створіть клас Bank. Уявіть,
        що ви реалізуєте програму для банку, яка допомагає визначити, погасив клієнт кредит чи ні.
        Припустимо, щомісячна сума платежу має становити 100 грн.
        Клієнт має виконати 7 платежів, але може платити рідше великими сумами.
        Тобто може двома платежами по 300 і 400 грн закрити весь борг.

        Створіть метод, який як аргумент прийматиме суму платежу, введену економістом банку.
        Метод виводить на екран інформацію про стан кредиту (сума заборгованості, сума переплат,
        повідомлення про відсутність боргу).*/